<?php

namespace Database\Seeders;

use App\Models\Country;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CountrySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $countries = [
            "ایران",
            "ایالات متحده آمریکا",
            "چین",
            "ژاپن",
            "آلمان",
            "فرانسه",
            "بریتانیا",
            "ایتالیا",
            "کانادا",
            "هند",
            "استرالیا",
            "برزیل",
            "مکزیک",
            "روسیه",
            "کره جنوبی",
            "هلند",
            "ترکیه",
            "سوئیس",
            "اسپانیا",
            "سوئد",
            "بلژیک",
            "نروژ",
            "دانمارک",
            "فنلاند",
            "اتریش",
            "لهستان",
            "آرژانتین",
            "شیلی",
            "پرتغال",
            "یونان",
            "مصر",
            "عربستان سعودی",
            "امارات متحده عربی",
            "قطر",
            "کویت",
            "عراق",
            "سوریه",
            "لبنان",
            "اردن",
            "فلسطین",
            "عمان",
            "یمن",
            "افغانستان",
            "پاکستان",
            "بنگلادش",
            "اندونزی",
            "مالزی",
            "سنگاپور",
            "تایلند",
            "ویتنام",
            "فیلیپین",
            "نیوزیلند",
            "ایرلند",
            "چک",
            "اسلواکی",
            "رومانی",
            "بلغارستان",
            "کرواسی",
            "اسلوونی",
            "مجارستان",
            "لیتوانی",
            "لاتویا",
            "استونی",
            "بلاروس",
            "اوکراین",
            "مولداوی",
            "آذربایجان",
            "گرجستان",
            "ارمنستان",
            "ازبکستان",
            "قزاقستان",
            "تاجیکستان",
            "قرقیزستان",
            "ترکمنستان",
            "مراکش",
            "الجزایر",
            "تونس",
            "لیبی",
            "سودان",
            "نیجریه",
            "آفریقای جنوبی",
            "اوگاندا",
            "کنیا",
            "زیمبابوه",
            "نامیبیا",
            "بوتسوانا",
            "موزامبیک",
            "تانزانیا",
            "مالاوی",
            "زامبیا",
            "اوگاندا",
            "سری‌لانکا",
            "نپال",
            "میانمار",
            "لائوس",
            "کامبوج",
            "برونئی",
            "پاپوآ گینه نو",
            "جزایر فیجی",
            "ساموآ",
            "تونگا",
            "وانواتو"
        ];

        foreach($countries as $country) {
            Country::query()->create(['name' => $country]);
        }
        
    }
}
